
# Binaries
brew 'autojump'
brew 'awscli'
brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Utilities that come with macOS are outdated
brew 'direnv'
brew 'dockutil'
brew 'findutils' # Utilities that come with macOS are outdated
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'grep'
brew 'gzip'
# brew 'lastpass-cli'
# brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
# brew 'tree'
# brew 'zsh'
# brew 'zsh-completions'

# Zsh configuration
brew 'powerlevel10k' # https://github.com/romkatv/powerlevel10k
brew 'zsh-syntax-highlighting'

# Development
#brew 'ant'
brew 'git'
brew 'git-extras'
brew 'git-flow'
cask 'intellij-idea-ce'
# brew 'maven'
# Note: temurin is the successor to adoptopenjdk
cask 'temurin'
# brew 'php'
# brew 'imagick'
# brew 'mysql'
brew 'node'
# brew 'sbt'
brew 'serverless'
# Note: Font casks require svn
brew 'svn'
# brew 'terraform'

# Apps
cask '1password'
cask '1password-cli'
# cask 'aerial'
# cask 'alfred'
# cask 'brave-browser'
# cask 'caffeine'
# cask 'discord'
cask 'docker'
cask 'firefox'
cask 'google-drive'
cask 'google-chrome'
# cask 'gpg-suite'
# cask 'grammarly'
# cask 'insomnia'
cask 'iterm2'
# cask 'lastpass'
cask 'logi-options-plus'
# cask 'mysqlworkbench'
# cask 'now'
cask 'protonvpn'
# cask 'quip'
cask 'rectangle'
# cask 'sequel-pro'
# cask 'shuttle'
cask 'signal'
cask 'skype'
cask 'slack'
cask 'spotify'
# cask 'tableplus'
cask 'ticktick'
# cask 'tor-browser'
# cask 'transmit'
# cask 'vagrant'
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
# cask 'vlc'
# cask 'whatsapp'
cask 'witch'

# Quicklook
# cask 'qlcolorcode'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'quicklook-csv'
# cask 'qlstephen'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'
cask 'font-meslo-for-powerline'
cask 'font-meslo-lg-nerd-font'

# VSCode
vscode 'k--kato.intellij-idea-keybindings'
